ioctl
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
writev
sendto
ioctl
getpriority
ioctl
ioctl
getuid
epoll_pwait
getuid
epoll_pwait
writev
ioctl
futex
futex
ioctl
getuid
epoll_pwait
recvfrom
writev
writev
writev
writev
writev
writev
writev
writev
writev
sendto
recvfrom
writev
sendto
recvfrom
getuid
epoll_pwait
recvfrom
writev
writev
writev
writev
writev
writev
writev
writev
writev
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
ioctl
getuid
epoll_pwait
getuid
epoll_pwait
ioctl
ioctl
getuid
epoll_pwait
getuid
epoll_pwait
ioctl
ioctl
getuid
epoll_pwait
recvfrom
sendto
recvfrom
recvfrom
sendto
sendto
recvfrom
ioctl
ioctl
ioctl
write
recvfrom
sendto
getuid
epoll_pwait
ioctl
ioctl
epoll_pwait
getuid
epoll_pwait
writev
close
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
ioctl
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
getuid
epoll_pwait
getuid
epoll_pwait
recvfrom
epoll_ctl
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
getuid
read
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
sched_yield
futex
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
recvfrom
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
write
write
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
ioctl
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
mprotect
openat
ioctl
ioctl
mmap
close
openat
ioctl
mmap
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
ioctl
ioctl
recvfrom
getuid
epoll_pwait
recvfrom
sendto
recvfrom
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
ioctl
sendto
recvfrom
sendto
write
rt_sigprocmask
ioctl
epoll_pwait
getuid
ioctl
mprotect
mprotect
mprotect
mprotect
sendto
write
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
sendto
sendto
sendto
sendto
writev
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
recvfrom
recvfrom
recvfrom
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
epoll_pwait
recvfrom
ioctl
write
getuid
epoll_pwait
recvfrom
sendto
recvfrom
getuid
epoll_pwait
recvfrom
sendto
write
write
getuid
epoll_pwait
read
recvfrom
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
recvfrom
writev
recvfrom
sendto
rt_sigprocmask
ioctl
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
ioctl
sendto
getuid
recvfrom
getuid
recvfrom
mprotect
mprotect
mprotect
madvise
madvise
pread
pread
mprotect
pread
pread
mmap
munmap
pread
pread
mmap
munmap
pread
pread
mmap
munmap
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
rt_sigprocmask
munmap
ioctl
ioctl
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
write
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
writev
write
ioctl
epoll_pwait
recvfrom
sendto
ioctl
getuid
epoll_pwait
recvfrom
recvfrom
sendto
write
recvfrom
ioctl
futex
ioctl
dup
ioctl
sendto
writev
recvfrom
writev
sendto
recvfrom
writev
writev
writev
writev
writev
writev
writev
writev
writev
sendto
write
ioctl
ioctl
ioctl
write
getuid
recvfrom
writev
sendto
recvfrom
writev
writev
writev
writev
writev
writev
writev
writev
writev
sendto
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
write
ioctl
ioctl
getuid
epoll_pwait
read
ioctl
read
getuid
recvfrom
ioctl
ioctl
write
write
sendto
recvfrom
sendto
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
ioctl
ioctl
sendto
recvfrom
sendto
epoll_ctl
ioctl
close
getuid
epoll_pwait
read
getuid
epoll_pwait
ioctl
ioctl
getuid
epoll_pwait
getuid
epoll_pwait
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
read
ioctl
ioctl
getuid
epoll_pwait
ioctl
recvfrom
sendto
write
epoll_pwait
read
recvfrom
mprotect
ioctl
ioctl
mprotect
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
recvfrom
sendto
recvfrom
sendto
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
write
getuid
epoll_pwait
read
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
read
recvfrom
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
write
getuid
sendto
epoll_pwait
recvfrom
pread
pread
mmap
write
pread
mmap
mmap
prctl
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
pread
pread
mmap
munmap
pread
pread
mmap
munmap
pread
pread
mmap
munmap
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
recvfrom
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
write
rt_sigprocmask
ioctl
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
write
ioctl
write
futex
getuid
recvfrom
recvfrom
ioctl
ioctl
write
sendto
recvfrom
recvfrom
sendto
ioctl
ioctl
ioctl
writev
recvfrom
sendto
getuid
epoll_pwait
read
recvfrom
sendto
getuid
sendto
recvfrom
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
epoll_pwait
recvfrom
sendto
recvfrom
ioctl
ioctl
sendto
recvfrom
sendto
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
ioctl
epoll_pwait
recvfrom
write
write
write
epoll_pwait
read
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
write
sendto
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
read
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
write
sendto
epoll_pwait
recvfrom
write
recvfrom
sendto
write
getuid
epoll_pwait
read
recvfrom
epoll_pwait
epoll_pwait
epoll_pwait
read
recvfrom
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
recvfrom
sendto
write
recvfrom
epoll_pwait
read
recvfrom
sendto
recvfrom
write
sendto
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
epoll_pwait
recvfrom
getuid
getuid
ioctl
sendto
recvfrom
write
getuid
epoll_pwait
read
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
write
write
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
recvfrom
sendto
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
sendto
epoll_pwait
read
recvfrom
ioctl
sendto
ioctl
epoll_pwait
recvfrom
write
recvfrom
sendto
recvfrom
sendto
recvfrom
writev
recvfrom
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
sendto
getuid
epoll_pwait
recvfrom
write
getuid
epoll_pwait
read
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
write
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
futex
futex
openat
ioctl
ioctl
mmap
close
futex
futex
futex
futex
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
write
recvfrom
write
epoll_pwait
recvfrom
sendto
ioctl
write
write
epoll_pwait
read
recvfrom
ioctl
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
writev
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
getuid
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
writev
recvfrom
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
recvfrom
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
write
write
epoll_pwait
read
recvfrom
ioctl
ioctl
write
sendto
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
write
write
recvfrom
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
sendto
recvfrom
sendto
ioctl
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
write
write
futex
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
write
epoll_pwait
read
recvfrom
recvfrom
recvfrom
ioctl
epoll_pwait
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
sendto
epoll_pwait
recvfrom
sendto
recvfrom
write
sendto
sendto
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
recvfrom
sendto
epoll_pwait
recvfrom
sendto
recvfrom
write
sendto
sendto
getuid
epoll_pwait
read
recvfrom
epoll_pwait
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
sendto
getuid
epoll_pwait
recvfrom
ioctl
sendto
getuid
epoll_pwait
ioctl
epoll_pwait
recvfrom
write
write
rt_sigprocmask
ioctl
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
writev
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
ioctl
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
write
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
ioctl
epoll_pwait
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
ioctl
sendto
epoll_pwait
recvfrom
write
sendto
ioctl
write
read
recvfrom
recvfrom
getuid
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
writev
sendto
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
sendto
recvfrom
writev
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
write
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
writev
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
read
recvfrom
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
write
ioctl
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
mprotect
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
rt_sigprocmask
ioctl
read
sendto
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
epoll_pwait
recvfrom
getuid
sendto
writev
write
write
futex
getuid
epoll_pwait
read
recvfrom
write
sendto
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
writev
sendto
ioctl
write
futex
getuid
epoll_pwait
read
recvfrom
recvfrom
ioctl
write
sendto
recvfrom
writev
recvfrom
sendto
sendto
sendto
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
ioctl
write
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
sendto
getuid
epoll_pwait
writev
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
recvfrom
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
recvfrom
sendto
write
rt_sigprocmask
ioctl
futex
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
getuid
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
getuid
getuid
epoll_pwait
getuid
epoll_pwait
getuid
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
writev
ioctl
write
write
getuid
epoll_pwait
futex
epoll_pwait
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
write
ioctl
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
futex
futex
getuid
ioctl
sendto
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
getuid
recvfrom
ioctl
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
recvfrom
sendto
recvfrom
sendto
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
getuid
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
getuid
epoll_pwait
recvfrom
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
writev
ioctl
write
futex
getuid
epoll_pwait
read
recvfrom
getuid
epoll_pwait
sendto
ioctl
getuid
epoll_pwait
recvfrom
sendto
recvfrom
recvfrom
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
recvfrom
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
recvfrom
write
getuid
epoll_pwait
read
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
write
pread
pread
mmap
munmap
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
write
write
ioctl
recvfrom
writev
getuid
epoll_pwait
read
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
recvfrom
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
ioctl
ioctl
getuid
epoll_pwait
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
sendto
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
write
write
recvfrom
sendto
recvfrom
ioctl
epoll_pwait
recvfrom
ioctl
sendto
ioctl
epoll_pwait
recvfrom
write
sendto
recvfrom
sendto
recvfrom
madvise
sendto
recvfrom
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
epoll_pwait
read
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
sendto
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
writev
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
recvfrom
ioctl
ioctl
epoll_pwait
recvfrom
ioctl
recvfrom
write
writev
recvfrom
sendto
recvfrom
sendto
write
write
recvfrom
recvfrom
ioctl
ioctl
write
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
sendto
recvfrom
write
writev
recvfrom
sendto
write
munmap
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
pread
pread
mmap
munmap
pread
pread
mmap
munmap
pread
pread
mmap
munmap
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
recvfrom
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
write
rt_sigprocmask
ioctl
write
epoll_pwait
read
recvfrom
getuid
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
write
getuid
epoll_pwait
read
write
sendto
recvfrom
recvfrom
sendto
recvfrom
sendto
writev
write
getuid
epoll_pwait
read
recvfrom
write
epoll_pwait
recvfrom
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
recvfrom
sendto
write
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
epoll_pwait
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
write
sendto
sendto
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
sendto
recvfrom
sendto
ioctl
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
futex
getuid
read
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
recvfrom
recvfrom
recvfrom
ioctl
epoll_pwait
read
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
ioctl
sendto
epoll_pwait
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
epoll_pwait
recvfrom
write
write
read
recvfrom
epoll_pwait
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
recvfrom
sendto
getuid
epoll_pwait
epoll_pwait
sendto
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
ioctl
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
write
recvfrom
sendto
write
rt_sigprocmask
ioctl
getuid
read
recvfrom
recvfrom
recvfrom
sendto
recvfrom
getuid
epoll_pwait
recvfrom
sendto
recvfrom
sendto
recvfrom
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
writev
write
getuid
epoll_pwait
read
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
write
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
write
recvfrom
sendto
write
ioctl
futex
getuid
epoll_pwait
read
recvfrom
recvfrom
writev
ioctl
write
write
recvfrom
recvfrom
write
futex
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
writev
recvfrom
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
write
recvfrom
sendto
epoll_pwait
sendto
write
epoll_pwait
read
epoll_pwait
recvfrom
sendto
recvfrom
ioctl
ioctl
write
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
write
recvfrom
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
sendto
recvfrom
write
writev
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
recvfrom
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
sendto
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
recvfrom
recvfrom
sendto
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
write
write
ioctl
write
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
recvfrom
sendto
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
recvfrom
getuid
epoll_pwait
read
recvfrom
sendto
ioctl
ioctl
ioctl
futex
futex
getuid
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
sendto
recvfrom
sendto
ioctl
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
sendto
ioctl
futex
recvfrom
ioctl
ioctl
sendto
recvfrom
recvfrom
sendto
sendto
recvfrom
write
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
recvfrom
getuid
getuid
sendto
recvfrom
write
read
recvfrom
getuid
getuid
ioctl
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
sendto
recvfrom
sendto
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
sendto
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
ioctl
write
recvfrom
sendto
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
recvfrom
sendto
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
getuid
epoll_pwait
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
write
recvfrom
sendto
write
getuid
epoll_pwait
epoll_pwait
recvfrom
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
ioctl
ioctl
sendto
recvfrom
recvfrom
recvfrom
ioctl
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
ioctl
recvfrom
write
writev
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
write
recvfrom
recvfrom
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
ioctl
recvfrom
recvfrom
sendto
recvfrom
sendto
recvfrom
write
rt_sigprocmask
madvise
munmap
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
munmap
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
ioctl
futex
getuid
epoll_pwait
read
recvfrom
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
recvfrom
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
futex
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
recvfrom
sendto
writev
rt_sigprocmask
ioctl
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
writev
ioctl
write
write
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
writev
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
ioctl
ioctl
ioctl
write
sendto
write
getuid
epoll_pwait
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
sendto
writev
recvfrom
sendto
recvfrom
sendto
write
ioctl
write
getuid
epoll_pwait
read
recvfrom
epoll_pwait
ioctl
write
write
epoll_pwait
read
recvfrom
recvfrom
recvfrom
write
sendto
recvfrom
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
ioctl
write
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
sendto
epoll_pwait
recvfrom
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
epoll_pwait
recvfrom
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
ioctl
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
write
ioctl
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
recvfrom
sendto
write
rt_sigprocmask
ioctl
getuid
epoll_pwait
read
recvfrom
write
ioctl
ioctl
ioctl
ioctl
close
ioctl
ioctl
close
ioctl
ioctl
close
getuid
getuid
epoll_pwait
recvfrom
sendto
ioctl
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
openat
ioctl
ioctl
mmap
close
ioctl
mmap
close
ioctl
ioctl
mmap
openat
ioctl
ioctl
mmap
close
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
write
getuid
epoll_pwait
read
recvfrom
sendto
writev
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
writev
recvfrom
sendto
recvfrom
pread
pread
mmap
mmap
prctl
prctl
munmap
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
sendto
recvfrom
sendto
rt_sigprocmask
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
madvise
getuid
recvfrom
recvfrom
getuid
epoll_pwait
epoll_pwait
recvfrom
recvfrom
getuid
epoll_pwait
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
recvfrom
write
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
sendto
recvfrom
recvfrom
sendto
sendto
epoll_pwait
recvfrom
sendto
recvfrom
write
getuid
epoll_pwait
read
epoll_pwait
recvfrom
ioctl
epoll_pwait
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
recvfrom
recvfrom
recvfrom
epoll_pwait
recvfrom
write
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
getuid
epoll_pwait
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
ioctl
ioctl
write
recvfrom
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
sendto
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
ioctl
getuid
read
recvfrom
recvfrom
getuid
epoll_pwait
recvfrom
write
futex
getuid
epoll_pwait
read
recvfrom
sendto
ioctl
write
write
getuid
epoll_pwait
read
recvfrom
recvfrom
sendto
writev
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
write
ioctl
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
sendto
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
write
write
rt_sigprocmask
madvise
ioctl
recvfrom
ioctl
ioctl
write
sendto
recvfrom
epoll_pwait
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
futex
getuid
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
sendto
ioctl
getuid
epoll_pwait
recvfrom
write
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
madvise
madvise
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
getuid
epoll_pwait
recvfrom
pread
pread
mmap
rt_sigprocmask
madvise
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
pread
pread
mmap
rt_sigprocmask
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
rt_sigprocmask
madvise
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
openat
ioctl
ioctl
mmap
close
getuid
getuid
ioctl
recvfrom
recvfrom
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
sendto
recvfrom
sendto
write
rt_sigprocmask
ioctl
getuid
read
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
recvfrom
sendto
recvfrom
sendto
sendto
sendto
sendto
sendto
sendto
ioctl
write
sendto
recvfrom
getuid
epoll_pwait
recvfrom
ioctl
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
getuid
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
getuid
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
epoll_pwait
epoll_pwait
getuid
epoll_pwait
epoll_pwait
epoll_pwait
getuid
epoll_pwait
getuid
getuid
writev
recvfrom
sendto
recvfrom
sendto
ioctl
write
epoll_pwait
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
recvfrom
recvfrom
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
sendto
sendto
writev
getuid
epoll_pwait
recvfrom
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
ioctl
write
sendto
recvfrom
sendto
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
epoll_pwait
recvfrom
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
sendto
ioctl
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
getuid
getuid
ioctl
sendto
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
write
epoll_pwait
recvfrom
sendto
write
recvfrom
ioctl
ioctl
sendto
recvfrom
recvfrom
recvfrom
sendto
sendto
sendto
ioctl
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
getuid
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
epoll_pwait
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
ioctl
ioctl
write
sendto
epoll_pwait
recvfrom
sendto
write
epoll_pwait
read
recvfrom
sendto
epoll_pwait
recvfrom
write
write
getuid
epoll_pwait
read
recvfrom
sendto
getuid
epoll_pwait
recvfrom
sendto
write
recvfrom
recvfrom
